posts/lapack/index.org
#+BEGIN_COMMENT
.. title: LAPACK
.. slug: lapack
.. date: 2021-05-10 09:46:43 UTC+08:00
.. tags: C, BLAS, LAPACK
.. category: library
.. link: 
.. description: 
.. type: text

#+END_COMMENT

* LAPACK
  主页在 [[https://www.netlib.org/lapack/]], 文档在 [[https://www.netlib.org/lapack/explore-html/]].

  安装说明
1. ~liblapack~ 是本体
2. ~liblapacke~ 是 c 的绑定

** dsyevd: 实对称矩阵本征值
   
*** 参数说明
    1. ~jobz~ 计算任务类型， ~jobz = "N"~ 只计算本征值， ~jobz = "V"~ 计算本征值和本征矢
    2. ~UPLO~ 矩阵的存储方式, ~UPLO = "U"~ ~A~ 中存了上三角矩阵， ~UPLO = "L"~ 下三角矩阵
    3. ~N~ 矩阵维数
    4. ~A~ 输入矩阵 ~LDA * N~ 维，计算后会被破坏，或者保存为本征矢
    5. ~LDA~ 矩阵维数
    6. ~W~ 本征值向量 ~N~ 维，升序排列
    7. ~WORK~ 工作向量，~LWORK~ 维, ~WORK[0]~ 是最优的 ~LWORK~ 值
    8. ~LWORK~ 工作向量维数， ~LWORK = -1~ 计算最优的 ~LWORK~ 值
    9. ~IWORK~ 工作向量， ~LIWORK~ 维， ~IWORK[0]~ 是最优的 ~LIWORK~ 值
    10. ~LIWORK~ 工作向量维数， ~LIWORK = -1~ 计算最优的 ~LIWORK~ 值
    11. ~INFO~ 错误信息， ~info = 0~ 成功

