output/posts/lapack/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>LAPACK | chimez's blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://chimez.github.io/posts/lapack/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="chimez">
<link rel="prev" href="../arpack/" title="arpack" type="text/html">
<link rel="next" href="../meson/" title="meson" type="text/html">
<meta property="og:site_name" content="chimez's blog">
<meta property="og:title" content="LAPACK">
<meta property="og:url" content="https://chimez.github.io/posts/lapack/">
<meta property="og:description" content='LAPACK


主页在 https://www.netlib.org/lapack/, 文档在 https://www.netlib.org/lapack/explore-html/.



安装说明


liblapack 是本体
liblapacke 是 c 的绑定




dsyevd: 实对称矩阵本征值



参数说明


jobz 计算任务类型， jobz = "N" 只计算本征值， '>
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-05-10T09:46:43+08:00">
<meta property="article:tag" content="BLAS">
<meta property="article:tag" content="C">
<meta property="article:tag" content="LAPACK">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">chimez's blog</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">LAPACK</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    chimez
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2021-05-10T09:46:43+08:00" itemprop="datePublished" title="2021-05-10 09:46">2021-05-10 09:46</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org09f6b86" class="outline-2">
<h2 id="org09f6b86">LAPACK</h2>
<div class="outline-text-2" id="text-org09f6b86">
<p>
主页在 <a href="https://www.netlib.org/lapack/">https://www.netlib.org/lapack/</a>, 文档在 <a href="https://www.netlib.org/lapack/explore-html/">https://www.netlib.org/lapack/explore-html/</a>.
</p>

<p>
安装说明
</p>
<ol class="org-ol">
<li>
<code>liblapack</code> 是本体</li>
<li>
<code>liblapacke</code> 是 c 的绑定</li>
</ol>
</div>

<div id="outline-container-org601465e" class="outline-3">
<h3 id="org601465e">dsyevd: 实对称矩阵本征值</h3>
<div class="outline-text-3" id="text-org601465e">
</div>
<div id="outline-container-orgcf8ac6a" class="outline-4">
<h4 id="orgcf8ac6a">参数说明</h4>
<div class="outline-text-4" id="text-orgcf8ac6a">
<ol class="org-ol">
<li>
<code>jobz</code> 计算任务类型， <code>jobz = "N"</code> 只计算本征值， <code>jobz = "V"</code> 计算本征值和本征矢</li>
<li>
<code>UPLO</code> 矩阵的存储方式, <code>UPLO = "U"</code> <code>A</code> 中存了上三角矩阵， <code>UPLO = "L"</code> 下三角矩阵</li>
<li>
<code>N</code> 矩阵维数</li>
<li>
<code>A</code> 输入矩阵 <code>LDA * N</code> 维，计算后会被破坏，或者保存为本征矢</li>
<li>
<code>LDA</code> 矩阵维数</li>
<li>
<code>W</code> 本征值向量 <code>N</code> 维，升序排列</li>
<li>
<code>WORK</code> 工作向量，~LWORK~ 维, <code>WORK[0]</code> 是最优的 <code>LWORK</code> 值</li>
<li>
<code>LWORK</code> 工作向量维数， <code>LWORK = -1</code> 计算最优的 <code>LWORK</code> 值</li>
<li>
<code>IWORK</code> 工作向量， <code>LIWORK</code> 维， <code>IWORK[0]</code> 是最优的 <code>LIWORK</code> 值</li>
<li>
<code>LIWORK</code> 工作向量维数， <code>LIWORK = -1</code> 计算最优的 <code>LIWORK</code> 值</li>
<li>
<code>INFO</code> 错误信息， <code>info = 0</code> 成功</li>
</ol>
</div>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/blas/" rel="tag">BLAS</a></li>
            <li><a class="tag p-category" href="../../categories/c/" rel="tag">C</a></li>
            <li><a class="tag p-category" href="../../categories/lapack/" rel="tag">LAPACK</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../arpack/" rel="prev" title="arpack">Previous post</a>
            </li>
            <li class="next">
                <a href="../meson/" rel="next" title="meson">Next post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2021         <a href="mailto:chimez@163.com">chimez</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
